In [3]:
import pandas as pd
import numpy as np

In [4]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [5]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [6]:
 string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [10]:
string_data.iloc[3] = np.nan

In [11]:
string_data

0     aardvark
1    artichoke
2          NaN
3          NaN
dtype: object

In [12]:
string_data.dropna()

0     aardvark
1    artichoke
dtype: object

In [13]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [14]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [15]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

### drop_duplicate

In [18]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

### rename

In [20]:
data.rename(index={'k1':'INDIANA'}, columns={'k2':'PEEKABOO'})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

### replace

In [21]:
a ='this is a string'

In [22]:
b=a.replace('string', 'longer string')
b

'this is a longer string'